brew "aom"
brew "cloudflared"
brew "cocogitto"
brew "colima"
brew "coreutils"
brew "xz"
brew "curl"
brew "docker"
brew "docker-compose"
brew "jpeg-xl"
brew "gh"
brew "openjpeg"
brew "tesseract"
brew "ghostscript"
brew "ghq"
brew "git"
brew "gitui"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lightgbm"
brew "marp-cli"
brew "mas"
brew "mise"
brew "multitail"
brew "osv-scanner"
brew "peco"
brew "poppler"
brew "pueue"
brew "reattach-to-user-namespace"
brew "repomix"
brew "rust"
brew "rust-analyzer"
brew "tabiew"
brew "texlive"
brew "tmux"
brew "tree"
brew "treemd"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "eugene1g/safehouse/agent-safehouse"
brew "k1low/tap/mo"
brew "microsoft/apm/apm"
brew "specstoryai/tap/specstory"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "affinity-photo"
cask "alfred@4"
cask "appcleaner"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "copilot-cli"
cask "cyberduck"
cask "discord"
cask "displaylink"
cask "docker-desktop"
cask "drawio"
cask "dropbox"
cask "eset-cyber-security"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "hammerspoon"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "libreoffice"
cask "lm-studio"
cask "mathpix-snipping-tool"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "nani"
cask "ngrok"
cask "obsidian"
cask "onedrive"
cask "quarto"
cask "skim"
cask "slack"
cask "table-tool"
cask "tableplus"
cask "the-unarchiver"
cask "kamillobinski/thock/thock"
cask "visual-studio-code"
cask "zoom"
cask "zotero"
