tap "charmbracelet/tap"
tap "cloudflare/cloudflare"
tap "gcenx/wine"
tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "k1low/tap"
tap "microsoft/apm"
tap "mtgto/macskk"
tap "specstoryai/tap"
brew "act"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "cloudflared"
brew "cmake"
brew "cocoapods"
brew "cocogitto"
brew "commitizen"
brew "coreutils"
brew "docker-compose"
brew "openjpeg"
brew "tesseract"
brew "ffmpeg"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "htop"
brew "imagemagick"
brew "mas"
brew "mise"
brew "mysql"
brew "nginx"
brew "numpy"
brew "ollama"
brew "pandoc"
brew "peco"
brew "podman"
brew "poppler"
brew "pueue"
brew "python@3.10"
brew "python@3.9"
brew "redis"
brew "rust"
brew "rust-analyzer"
brew "scipy"
brew "tailscale"
brew "tcl-tk"
brew "tesseract-lang"
brew "texlive"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "winetricks"
brew "xleak"
brew "yarn"
brew "zsh-autosuggestions"
brew "charmbracelet/tap/crush"
brew "k1low/tap/mo"
brew "microsoft/apm/apm"
brew "specstoryai/tap/specstory"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "affinity-photo"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "copilot-cli"
cask "cyberduck"
cask "discord"
cask "displaylink"
cask "docker-desktop"
cask "drawio"
cask "dropbox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "gstreamer-runtime"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "lm-studio"
cask "mactex-no-gui"
cask "mathpix-snipping-tool"
cask "microsoft-teams"
cask "ngrok"
cask "obsidian"
cask "skim"
cask "slack"
cask "tableplus"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoom"
cask "zotero@beta"
mas "Amphetamine", id: 937984704
mas "AS Timer", id: 512464723
mas "Goodnotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Klack", id: 6446206067
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "google.colab"
vscode "hediet.vscode-drawio"
vscode "iamhyc.overleaf-workshop"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jdinhlife.gruvbox"
vscode "johnpapa.vscode-peacock"
vscode "kevinrose.vsc-python-indent"
vscode "kirozen.wordcounter"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "meta.pyrefly"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-commander"
vscode "ms-vscode.vscode-copilot-data-analysis"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "openai.chatgpt"
vscode "quarto.quarto"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
cargo "bat"
cargo "exa"
cargo "fd-find"
cargo "hexyl"
cargo "procs"
cargo "ripgrep"
cargo "tokei"
npm "takt"
